Revit 2027 API
GroupTypeId.GreenBuilding Property
 Green Building Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GreenBuilding { get; }
Public Shared ReadOnly Property GreenBuilding As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GreenBuilding {
	ForgeTypeId^ get ();
}
static member GreenBuilding : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace